CanBusHack/2017carhackingvillagebadge/DC2017/Src/source/pin_mux.h
/* PORTD3 (number 130), LED_SH_CLK */
#define BOARD_INITPINS_LED_SH_CLK_GPIO                                     GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_LED_SH_CLK_PORT                                     PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_LED_SH_CLK_GPIO_PIN                                    3U   /*!< PORTD pin index: 3 */
#define BOARD_INITPINS_LED_SH_CLK_PIN_NAME                                  PTD3   /*!< Pin name */
#define BOARD_INITPINS_LED_SH_CLK_LABEL                             "LED_SH_CLK"   /*!< Label */
#define BOARD_INITPINS_LED_SH_CLK_NAME                              "LED_SH_CLK"   /*!< Identifier name */
#define BOARD_INITPINS_LED_SH_CLK_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTD4 (number 131), LED_ST_CLK */
#define BOARD_INITPINS_LED_ST_CLK_GPIO                                     GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_LED_ST_CLK_PORT                                     PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_LED_ST_CLK_GPIO_PIN                                    4U   /*!< PORTD pin index: 4 */
#define BOARD_INITPINS_LED_ST_CLK_PIN_NAME                                  PTD4   /*!< Pin name */
#define BOARD_INITPINS_LED_ST_CLK_LABEL                             "LED_ST_CLK"   /*!< Label */
#define BOARD_INITPINS_LED_ST_CLK_NAME                              "LED_ST_CLK"   /*!< Identifier name */
#define BOARD_INITPINS_LED_ST_CLK_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTD12 (number 141), OBD2_DET */
#define BOARD_INITPINS_OBD2_DET_GPIO                                       GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_OBD2_DET_PORT                                       PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_OBD2_DET_GPIO_PIN                                     12U   /*!< PORTD pin index: 12 */
#define BOARD_INITPINS_OBD2_DET_PIN_NAME                                   PTD12   /*!< Pin name */
#define BOARD_INITPINS_OBD2_DET_LABEL                                 "OBD2_DET"   /*!< Label */
#define BOARD_INITPINS_OBD2_DET_NAME                                  "OBD2_DET"   /*!< Identifier name */
#define BOARD_INITPINS_OBD2_DET_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTD13 (number 142), BAT_PPR */
#define BOARD_INITPINS_BAT_PPR_GPIO                                        GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_BAT_PPR_PORT                                        PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_BAT_PPR_GPIO_PIN                                      13U   /*!< PORTD pin index: 13 */
#define BOARD_INITPINS_BAT_PPR_PIN_NAME                                    PTD13   /*!< Pin name */
#define BOARD_INITPINS_BAT_PPR_LABEL                                   "BAT_PPR"   /*!< Label */
#define BOARD_INITPINS_BAT_PPR_NAME                                    "BAT_PPR"   /*!< Identifier name */
#define BOARD_INITPINS_BAT_PPR_DIRECTION                 kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTD14 (number 143), BAT_CHG */
#define BOARD_INITPINS_BAT_CHG_GPIO                                        GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_BAT_CHG_PORT                                        PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_BAT_CHG_GPIO_PIN                                      14U   /*!< PORTD pin index: 14 */
#define BOARD_INITPINS_BAT_CHG_PIN_NAME                                    PTD14   /*!< Pin name */
#define BOARD_INITPINS_BAT_CHG_LABEL                                   "BAT_CHG"   /*!< Label */
#define BOARD_INITPINS_BAT_CHG_NAME                                    "BAT_CHG"   /*!< Identifier name */
#define BOARD_INITPINS_BAT_CHG_DIRECTION                 kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTD15 (number 144), SD_DET */
#define BOARD_INITPINS_SD_DET_GPIO                                         GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_SD_DET_PORT                                         PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_SD_DET_GPIO_PIN                                       15U   /*!< PORTD pin index: 15 */
#define BOARD_INITPINS_SD_DET_PIN_NAME                                     PTD15   /*!< Pin name */
#define BOARD_INITPINS_SD_DET_LABEL                                     "SD_DET"   /*!< Label */
#define BOARD_INITPINS_SD_DET_NAME                                      "SD_DET"   /*!< Identifier name */
#define BOARD_INITPINS_SD_DET_DIRECTION                  kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTD0 (number 127), LED_OE */
#define BOARD_INITPINS_LED_OE_PERIPHERAL                                    FTM3   /*!< Device name: FTM3 */
#define BOARD_INITPINS_LED_OE_SIGNAL                                          CH   /*!< FTM3 signal: CH */
#define BOARD_INITPINS_LED_OE_CHANNEL                                          0   /*!< FTM3 channel: 0 */
#define BOARD_INITPINS_LED_OE_PIN_NAME                                  FTM3_CH0   /*!< Pin name */
#define BOARD_INITPINS_LED_OE_LABEL                                     "LED_OE"   /*!< Label */
#define BOARD_INITPINS_LED_OE_NAME                                      "LED_OE"   /*!< Identifier name */
#define BOARD_INITPINS_LED_OE_DIRECTION                 kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTD6 (number 133), LED_TRUCK_1 */
#define BOARD_INITPINS_LED_TRUCK_1_GPIO                                    GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INITPINS_LED_TRUCK_1_PORT                                    PORTD   /*!< PORT device name: PORTD */
#define BOARD_INITPINS_LED_TRUCK_1_GPIO_PIN                                   6U   /*!< PORTD pin index: 6 */
#define BOARD_INITPINS_LED_TRUCK_1_PIN_NAME                                 PTD6   /*!< Pin name */
#define BOARD_INITPINS_LED_TRUCK_1_LABEL                           "LED_TRUCK_1"   /*!< Label */
#define BOARD_INITPINS_LED_TRUCK_1_NAME                            "LED_TRUCK_1"   /*!< Identifier name */
#define BOARD_INITPINS_LED_TRUCK_1_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

