CanBusHack/2017carhackingvillagebadge/DC2017/Src/source/pin_mux.h
/* PORTC4 (number 109), LED_TRUCK_2 */
#define BOARD_INITPINS_LED_TRUCK_2_GPIO                                    GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_TRUCK_2_PORT                                    PORTC   /*!< PORT device name: PORTC */
#define BOARD_INITPINS_LED_TRUCK_2_GPIO_PIN                                   4U   /*!< PORTC pin index: 4 */
#define BOARD_INITPINS_LED_TRUCK_2_PIN_NAME                                 PTC4   /*!< Pin name */
#define BOARD_INITPINS_LED_TRUCK_2_LABEL                           "LED_TRUCK_2"   /*!< Label */
#define BOARD_INITPINS_LED_TRUCK_2_NAME                            "LED_TRUCK_2"   /*!< Identifier name */
#define BOARD_INITPINS_LED_TRUCK_2_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTC0 (number 103), CHARGE_ENA */
#define BOARD_INITPINS_CHARGE_ENA_GPIO                                    GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_INITPINS_CHARGE_ENA_PORT                                    PORTC   /*!< PORT device name: PORTC */
#define BOARD_INITPINS_CHARGE_ENA_GPIO_PIN                                   0U   /*!< PORTC pin index: 0 */
#define BOARD_INITPINS_CHARGE_ENA_PIN_NAME                                 PTC0   /*!< Pin name */
#define BOARD_INITPINS_CHARGE_ENA_LABEL                           "CHARGE_ENA"   /*!< Label */
#define BOARD_INITPINS_CHARGE_ENA_NAME                            "CHARGE_ENA"   /*!< Identifier name */
#define BOARD_INITPINS_CHARGE_ENA_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTC1 (number 104), LED_TRUCK_0 */
#define BOARD_INITPINS_LED_TRUCK_0_GPIO                                    GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_TRUCK_0_PORT                                    PORTC   /*!< PORT device name: PORTC */
#define BOARD_INITPINS_LED_TRUCK_0_GPIO_PIN                                   2U   /*!< PORTC pin index: 1 */
#define BOARD_INITPINS_LED_TRUCK_0_PIN_NAME                                 PTC2   /*!< Pin name */
#define BOARD_INITPINS_LED_TRUCK_0_LABEL                           "LED_TRUCK_0"   /*!< Label */
#define BOARD_INITPINS_LED_TRUCK_0_NAME                            "LED_TRUCK_0"   /*!< Identifier name */
#define BOARD_INITPINS_LED_TRUCK_0_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
